import _ from 'lodash'
const sampleEvent = {
  date: '26 сентября 2016 г.',
  timeExtend: '10:00 - 10:30',
  about: 'В докладе будут представлены подходы к управлению комплексными географически-распределёнными проектами на примере проектов и даны рекомендации по управлению аналогичными проектами',
  author: 'ДЖАДАН В.',
  avatar: '/photos/%D0%94%D0%B6%D0%B0%D0%B4%D0%B0%D0%BD.png'
}
const events = {
  11000: {
    id: '11000',
    room: '1',
    time: '10:00',
    title: 'Вызовы рынка и общая стратегия компании',
  },
  11030: {
    id: '11030',
    room: '1',
    time: '10:30',
    title: 'Блок 1: Основные проекты и бизнес задачи заказчиков',
  },
  11145: {
    id: '11145',
    room: '1',
    time: '11:45',
    title: 'Блок 2: Основные проекты и бизнес задачи заказчиков',
  },
  11245: {
    id: '11245',
    room: '1',
    time: '12:45',
    title: 'Будущее с платформой S/4HANA',
  },
  21415: {
    id: '21415',
    room: '2',
    time: '14:15',
    title: 'Подходы к управлению комплексными проектами на примере реализованных проектов',
  },
  21435: {
    id: '21435',
    room: '2',
    time: '14:35',
    title: 'Тиражирование шаблонных решений – управление проектами',
  },
  21500: {
    id: '21500',
    room: '2',
    time: '15:00',
    title: 'Организация работы проектной команды на площадке клиента на примере проекта по тиражированию АС УВХД в ПАО "Сбербанк России"',
  },
  21435: {
    id: '21435',
    room: '2',
    time: '14:35',
    title: 'Тиражирование шаблонных решений – управление проектами',
  },

  21520: {
    id: '21520',
    time: '15:20',
    room: '2',
    title: 'Организации гарантийной поддержки в компании БДО',
  },
  21540: {
    id: '21540',
    time: '15:40',
    room: '2',
    title: 'Кофе пауза',
  },
  21555: {
    id: '21555',
    time: '15:55',
    room: '2',
    title: 'Управление архитектурой проекта',
  },
  21615: {
    id: '21615',
    time: '16:15',
    room: '2',
    title: 'Новая методология разработок: опыт проекта ИЛИМ',
  },
  21640: {
    id: '21640',
    time: '16:40',
    room: '2',
    title: 'Интеграции SAP vs Primavera. Уроки проектов внедрения',
  },
  21700: {
    id: '21700',
    time: '17:00',
    room: '2',
    title: 'SCRUM - инновационный подход к управлению проектами',
  },
  21725: {
    id: '21725',
    time: '17:25',
    room: '2',
    title: 'Применение достижений современной науки в повседневном управлении проектами',
  },

  31415: {
    id: '31415',
    time: '14:15',
    room: '3',
    title: 'Апробированные решения для управления запасами и резервами ТМЦ',
  },
  31435: {
    id: '31435',
    time: '14:35',
    room: '3',
    title: 'Ariba – новые возможности закупок',
  },
  31500: {
    id: '31500',
    time: '15:00',
    room: '3',
    title: 'Hybris - новая коммуникационная платформа продаж',
  },
  31520: {
    id: '31520',
    time: '15:20',
    room: '3',
    title: 'Инновации в логистических процессах SAP S/4HANA',
  },
  31540: {
    id: '31540',
    time: '15:40',
    room: '3',
    title: 'Кофе пауза',
  },
  31555: {
    id: '31555',
    time: '15:55',
    room: '3',
    title: 'Industry 4.0: Планирование и управление производством в эпоху четвертой промышленной революции',
  },
  31615: {
    id: '31615',
    time: '16:15',
    room: '3',
    title: 'Управление договорами (опыт МОЭСКа)',
  },
  31640: {
    id: '31640',
    time: '16:40',
    room: '3',
    title: 'Контроль качества при использовании EWM. Интеграция решения с внешними MES и LIMS системами',
  },
  31700: {
    id: '31700',
    time: '17:00',
    room: '3',
    title: 'Управление деятельностью по поддержанию основных фондов на основе PS и ТОРО',
  },
  31725: {
    id: '31725',
    time: '17:25',
    room: '3',
    title: 'Полноценный электронный документооборот для управления закупками: портал Web, SRM, ERP (опыт Сбербанка)',
  },

  41415: {
    id: '41415',
    time: '14:15',
    room: '4',
    title: 'HANA в Управлении финансами',
  },
  41435: {
    id: '41435',
    time: '14:35',
    room: '4',
    title: 'Host-to-host на FIORI (опыт НЛМК)',
  },
  41500: {
    id: '41500',
    time: '15:00',
    room: '4',
    title: 'PPM как средство управления портфелем проектов',
  },
  41520: {
    id: '41520',
    time: '15:20',
    room: '4',
    title: 'Контроль инвестиций',
  },
  41540: {
    id: '41540',
    time: '15:40',
    room: '4',
    title: 'Кофе пауза',
  },
  41555: {
    id: '41555',
    time: '15:55',
    room: '4',
    title: 'Особенности внедрения SAP ERP в банковском секторе на примере проекта тиражирования АС УВХД SAP в ПАО Сбербанк',
  },
  41615: {
    id: '41615',
    time: '16:15',
    room: '4',
    title: 'Особенности организации задач налогового учета и МСФО',
  },
  41640: {
    id: '41640',
    time: '16:40',
    room: '4',
    title: 'Расчет себестоимости продукции по активным компонентам и собственникам. Опыт реализации проекта Норникель',
  },
  41700: {
    id: '41700',
    time: '17:00',
    room: '4',
    title: 'Проблемы интеграции бюджетирования и контроллинга',
  },
  41725: {
    id: '41725',
    time: '17:25',
    room: '4',
    title: 'Использование BPC для решения задач консолидации МСФО и внутригрупповой отчетности',
  },

  51415: {
    id: '51415',
    time: '14:15',
    room: '5',
    title: 'Проект миграции BW-системы в HANA Enterprise Cloud для X5 Retail Group',
  },
  51435: {
    id: '51435',
    time: '14:35',
    room: '5',
    title: 'Новшества в языке ABAP современных версий SAP NetWeaver',
  },
  51500: {
    id: '51500',
    time: '15:00',
    room: '5',
    title: 'Enterpise Bots - первый шаг к Enterprise AI',
  },
  51520: {
    id: '51520',
    time: '15:20',
    room: '5',
    title: 'S/4HANA - встроенная аналитика',
  },
  51540: {
    id: '51540',
    time: '15:40',
    room: '5',
    title: 'Кофе пауза',
  },
  51555: {
    id: '51555',
    time: '15:55',
    room: '5',
    title: 'Обзор сценариев IoT',
  },
  51615: {
    id: '51615',
    time: '16:15',
    room: '5',
    title: 'Есть ли в SAP-е Big Data?',
  },
  51640: {
    id: '51640',
    time: '16:40',
    room: '5',
    title: 'Возможности Fiori Overview Page',
  },
  51700: {
    id: '51700',
    time: '17:00',
    room: '5',
    title: 'Современные подходы к интеллектуальному анализу данных',
  },
  51725: {
    id: '51725',
    time: '17:25',
    room: '5',
    title: 'Генерация пользовательских интерфейсов на базе аннотаций ABAP CDS',
  },
}
const timeline = [
  {
    type: 'default',
    time: '9:00',
    title: 'Сбор, автобусы от м. Кунцевская',
  },
  {
    type: 'default',
    time: '9:30',
    title: 'Приветственный кофе',
  },
  11000,
  11030,
  {
    type: 'default',
    time: '11:30',
    title: 'Кофе пауза',
  },
  11145,
  11245,
  {
    type: 'default',
    time: '13:15',
    title: 'Обед',
  },
  21415,
  31415,
  41415,
  51415,

  21435,
  31435,
  41435,
  51435,
  {
    type: 'default',
    title: 'Перерыв 5 минут',
  },

  21500,
  31500,
  41500,
  51500,

  21520,
  31520,
  41520,
  51520,

  {
    type: 'default',
    time: '15:40',
    title: 'Кофе пауза',
  },

  21555,
  31555,
  41555,
  51555,

  21615,
  31615,
  41615,
  51615,

  {
    type: 'default',
    title: 'Перерыв 5 минут',
  },

  21640,
  31640,
  41640,
  51640,

  21700,
  31700,
  41700,
  51700,

  {
    type: 'default',
    title: 'Перерыв 5 минут',
  },
  21725,
  31725,
  41725,
  51725,
]

function getTimeline(room = null){
  const room1Length = 8
  let currentTimeline = []
  if (room == null) {
    currentTimeline = timeline
  } else if (room == 1) {
    currentTimeline = timeline.slice(0, room1Length)
  } else {
    currentTimeline = timeline.slice(room1Length).filter(objOrId => {
      if (_.isPlainObject(objOrId)) return true
      return events[objOrId].room == room
    })
  }
  return currentTimeline.map(objOrId => {
    if (_.isPlainObject(objOrId)) return objOrId
    return Object.assign({}, sampleEvent, events[objOrId])
  })
}

const rooms = {
  1: {
    title: 'Пленарная сессия',
    short: 'Пленарная сессия',
    color: 'rgb(237, 26, 59)',
    timeline: getTimeline(1),
  },
  2: {
    title: 'Архитектура и проектное управление',
    short: 'Архитектура',
    color: 'rgb(152, 0, 46)',
    timeline: getTimeline(2),
  },
  3: {
    title: 'Логистика и производство',
    short: 'Логистика',
    color: 'rgb(244, 174, 99)',
    timeline: getTimeline(3),
  },
  4: {
    title: 'Финансы и инвестиции',
    short: 'Финансы',
    color: 'rgb(248, 90, 122)',
    timeline: getTimeline(4),
  },
  5: {
    title: 'Инновации и разработки',
    short: 'Инновации',
    color: 'rgb(98, 202, 227)',
    timeline: getTimeline(5),
  },
}
export default () => ({
  timeline: getTimeline(null),
  rooms,
  events,
})
